Repository: texinsightt/Packaged-sdks
Catalog: Sources/NewkyFaceSupport/*.lproj/Localizable.strings
Languages: tr

source: Hello
tr: Merhaba

source: Driver
tr: Sürücü

source: Passenger
tr: Yolcu

source: Continue
tr: Devam Et

source: Repeat
tr: Tekrarlamak

source: cancel
tr: Vazgeç

source: Success!
tr: Başarılı!

source: Error!
tr: Hata!

source: Sign Out
tr: Çıkış Yap

source: Register
tr: Kayıt Ol

source: Sign In
tr: Giriş Yap

source: Next
tr: Devam Et

source: Back
tr: Geri Dön

source: Name
tr: Ad

source: Surname
tr: Soyad

source: Plate
tr: Plaka

source: Phone Number
tr: Telefon Numarası

source: Users Identifier
tr: T.C. Kimlik Numarası

source: Verify
tr: Doğrula

source: Update
tr: Güncelle

source: Try Again
tr: Tekrar Dene

# something_went_wrong
source: Something went wrong, please try again.
tr: Bir şeyler ters gitti lütfen tekrar deneyin.

source: Start
tr: Başla

source: Capture
tr: Fotoğraf Çek

# start_drive
source: Start Driving
tr: Sürüşe Başla

# finish_drive
source: Finish Driving
tr: Sürüşü bitir

source: Exit
tr: Çık

source: Please Wait...
tr: Lütfen Bekleyin...

source: Processed frames:
tr: İşlenmiş çerçeveler:

# sdk_not_initialized
source: The SDK is not initialized.
tr: SDK başlatılamadı.

# invalid_api_key_error
source: Your API Key is invalid.
tr: API Anahtarınız geçersiz.

# setup_firebase_failure
source: Firebase Installation failed.
tr: Firebase Kurulumu başarısız.

# document_not_found
source: Document could not be found.
tr: Belge bulunamadı.

# firestore_request_failed
source: The Firestore request failed.
tr: Firestore isteği başarısız.

# main_text_start
source: Wait until the bar is full so that the blue frame framing your face fits inside the preview.
tr: Yüzünüzü çerçeveleyen mavi çerçeve önizlemenin içine denk gelecek şekilde bar dolana kadar bekleyin.

# navigation_label_text_start
source: Tap start to get started.
tr: Başlamak için başla'ya dokun.

# face_id_reg_completed
source: Scan of the face is completed, you can touch the button to continue the registration process.
tr: Yüzün taraması tamamlandı kayıt işlemine Devam etmek için butona basabilirsiniz.

# face_id_backend_reg_fail
source: Facial data could not be successfully saved
tr: Yüz verileri başarılı bir şeilde kaydedilemedi

# face_id_backend_already_exist
source: This user is already registered.
tr: Bu kullanıcı çoktan kayıtlı.

# face_id_backend_server_err
source: An unexpected problem has occurred.
tr: Beklenmeyen bir sorun oluştu.

# face_id_backend_user_not_match
source: Photo from the ID card and the driver's face did not match. Please try again.
tr: Kimlik ile sürücü eşleşmedi. Lütfen tekrar deneyin.

# introduce_face_title
source: Introduce your face to the camera
tr: Yüzünüzü kameraya tanıtın

# register_in_progress_title
source: Registration in progress...
tr: Kayıt devam ediyor...

source: Identify your face
tr: Yüzünüzü tanıtın

source: Searching for user...
tr: Kullanıcı aranıyor...

# fix_turn_left
source: Turn your face left, your face should be across the phone.
tr: Yüzünüzü telefona karşılıklı olacak şekilde sola çevirin.

# fix_turn_right
source: Turn your face right, your face should be across the phone.
tr: Yüzünüzü telefona karşılıklı olacak şekilde sağa çevirin.

# fix_turn_down
source: Turn your face down, your face should be across the phone.
tr: Yüzünüzü telefona karşılıklı olacak şekilde yukarı kaldırın.

# fix_turn_up
source: Turn your face up, your face should be across the phone.
tr: Yüzünüzü telefona karşılıklı olacak şekilde aşağı indirin.

# face_analyz_err
source: There was a problem analyzing the face, put your face in the correct position and try again.
tr: Yüz analiz edilirken bir sorun oluştu yüzünüzü doğru pozisyona getirip tekrar deneyin.

# show_a_face
source: Show your face to the camera.
tr: Kameraya yüzünüzü gösterin

# show_just_one_face
source: Show only your face to the camera.
tr: Kameraya sadece kendi yüzünüzü gösterin.

# show_face_in_prew
source: Hold the phone with your face in the center of the camera preview.
tr: Yüzünüzü çerçevenin ortasına gelecek şekilde telefonu tutun.

# login_with_face_start_des
source: Introduce your face to start driving. Hold the phone with your face inside the square.
tr: Sürüşe başlamak için yüzünüzü tanıtın. yüzünüz karenin içine gelecek şekilde telefonu tutunuz

# login_nok_des
source: Not registered user who tried to login
tr: Giriş yapmayı deneyen kayıtlı kullanıcı değil

# login_face_not_detect_des
source: No face detected in the sent photo
tr: Gonderilen fotoğrafta herhangi bir yüz tespit edilemedi

# login_user_not_found_des
source: There is no registered user with this id
tr: Bu id ile kayıtlı bir kullanıcı yok

# login_server_err_des
source: An unexpected error has occurred, please try again
tr: Beklenmedik bir hata oluştu, Lütfen tekrar deneyin

# register_step_title
source: Complete the steps to register
tr: Kayıt olmak için adımları tamamlayın

# register_step_by_face
source: Face Recognition
tr: Yüz Tanıma

# register_step_by_card
source: Driver License
tr: Kimlik Kartı

# register_step_by_face_description
source: Create a record by introducing your face
tr: Yüzünüzü tanıtarak kayıt oluşturun

# register_step_by_card_description
source: Create a record by uploading the front of your ID
tr: Kimliğinizin ön ve arka yüzünü yükleyerek kayıt oluşturun

# register_result_success
source: Registration Successful!
tr: Kayıt Başarılı!

# register_result_failure
source: Registration Failed!
tr: Kayıt Başarısız!
